tests/shop/advantage/fixtures/purchase-failed.json

{
    "accountID": "aAbBcCdD", 
    "createdAt": "2022-02-23T13:52:06.877Z", 
    "createdBy": "email.address@canonical.com", 
    "id": "pAaBbCcDd", 
    "invoice": {
      "amountDue": 22500, 
      "currency": "usd", 
      "customerAddress": {
        "city": "London", 
        "country": "GB", 
        "line1": "Street", 
        "line2": "", 
        "postal_code": "123321", 
        "state": ""
      }, 
      "customerEmail": "email.address@canonical.com", 
      "customerName": "Email Address Name", 
      "id": {
        "IDs": [
          "in_AaBbCcDd"
        ], 
        "origin": "Stripe"
      }, 
      "identifier": "123123", 
      "lineItems": [
        {
          "currency": "usd", 
          "description": "1 machine x UA Infrastructure - Essential (Physical) (at $225.00 / year)", 
          "planID": {
            "IDs": [
              "1231222"
            ], 
            "origin": "Stripe"
          }, 
          "proRatedAmount": 22500, 
          "quantity": 1
        }
      ], 
      "paymentStatus": {
        "lastPaymentError": "generic_decline", 
        "status": "need_another_payment_method"
      }, 
      "reason": "subscription_create", 
      "status": "open", 
      "subscriptionID": {
        "IDs": [
          "sub_aAbBcCdD"
        ], 
        "origin": "Stripe"
      }, 
      "total": 22500, 
      "url": "download.link"
    }, 
    "lastModified": "2022-02-23T13:52:09.42Z", 
    "marketplace": "canonical-ua", 
    "purchaseItems": [
      {
        "paidForInCycle": 1, 
        "productListingID": "laAbBcCdD", 
        "value": 1
      }
    ], 
    "status": "processing", 
    "stripeInvoices": [
      {
        "id": "in_AaBbCcDd", 
        "last_update": "2022-02-23T13:52:16.244404Z", 
        "pi_decline_code": "generic_decline", 
        "pi_status": "requires_payment_method", 
        "subscription_status": "incomplete"
      }
    ], 
    "subscriptionID": "sAaBbCcDd"
  }
  